Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthEnum
The composite beam width options.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthEnum.COMPOSITE_BEAM_WIDTH_MANUAL
The composite beam width is set manually.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamWidthEnum.COMPOSITE_BEAM_WIDTH_AUTOMATIC
The composite beam width is set automatically.